Tekla.Structures.Model.Load.LoadAttachmentEnum
The load attachment.

Tekla.Structures.Model.Load.LoadAttachmentEnum.LOAD_ATTACHMENT_ATTACH_TO_MEMBER
Attach to member.

Tekla.Structures.Model.Load.LoadAttachmentEnum.LOAD_ATTACHMENT_DONT_ATTACH
Don't attach.